cases/Biofilm_growth/multi_pores/yxs/cyclic-yxs-6/0/Mb
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    left
    {
         type            fixedValue;
       value	       uniform 0;
    }

    right
    {
       
         type            fixedValue;
       value	       uniform 0;
    }

    bottom
    {
        
         type            fixedValue;
       value	       uniform 0;
    }

    top
    {
         type            fixedValue;
      value	       uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
