cases/Biofilm_growth/multi_pores/yxs/cyclic-yxs-6/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          62500;
        startFace       62125;
    }
    top
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          250;
        startFace       124625;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  bottom;
    }
    bottom
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          250;
        startFace       124875;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  top;
    }
    left
    {
        type            patch;
        nFaces          125;
        startFace       125125;
    }
    right
    {
        type            patch;
        nFaces          125;
        startFace       125250;
    }
)

// ************************************************************************* //
